<?php
namespace Amap;

/**
 * 根据错误码返回错误文字描述,问题排查策略查看
 * http://lbs.amap.com/api/webservice/guide/tools/info/
 */
class Error
{

    private static $err = [
        '10000' => '请求正常',
        '10001' => 'key不正确或过期',
        '10002' => '没有权限使用相应的服务或者请求接口的路径拼写错误',
        '10003' => '访问已超出日访问量',
        '10004' => '单位时间内访问过于频繁',
        '10005' => 'IP白名单出错，发送请求的服务器IP不在IP白名单内',
        '10006' => '绑定域名无效',
        '10007' => '数字签名未通过验证',
        '10008' => 'MD5安全码未通过验证',
        '10009' => '请求key与绑定平台不符',
        '10010' => 'IP访问超限',
        '10011' => '服务不支持https请求',
        '10012' => '权限不足，服务请求被拒绝',
        '10013' => 'Key被删除',
        '10014' => 'QPS超限',
        '10015' => '受单机QPS限流限制',
        '10016' => '服务器负载过高',
        '10017' => '所请求的资源不可用',
        '20000' => '请求参数非法',
        '20001' => '缺少必填参数',
        '20002' => '请求协议非法',
        '20003' => '其他未知错误',
        '20800' => '规划点（包括起点、终点、途经点）不在中国陆地范围内',
        '20801' => '划点（起点、终点、途经点）附近搜不到路',
        '20802' => '路线计算失败，通常是由于道路连通关系导致',
        '20803' => '起点终点距离过长。',
    ];

    static function getError($key)
    {
        if (strpos($key, '300') === 0) {
            return '服务响应失败';
        }
        return self::$err[$key];
    }
}

